CREATE DATABASE  IF NOT EXISTS `missions` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `missions`;
-- MySQL dump 10.13  Distrib 8.0.25, for Linux (x86_64)
--
-- Host: localhost    Database: missions
-- ------------------------------------------------------
-- Server version	8.0.25-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `assigners`
--

DROP TABLE IF EXISTS `assigners`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assigners` (
  `uid` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` varchar(100) DEFAULT NULL,
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `changed` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `name_UNIQUE` (`name`),
  KEY `key_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assigners`
--

LOCK TABLES `assigners` WRITE;
/*!40000 ALTER TABLE `assigners` DISABLE KEYS */;
INSERT INTO `assigners` VALUES (1,'Отдел информационных технологий','','2019-01-23 14:11:23','2019-01-23 14:11:23'),(2,'Отдел эксплуатации нефтепроводов','','2019-01-23 14:17:32','2019-01-23 14:17:32'),(3,'Отдел кадров','','2019-10-21 12:48:12','2019-10-21 12:48:12'),(4,'hehyethyte','','2019-10-21 12:50:27','2019-10-21 13:01:26');
/*!40000 ALTER TABLE `assigners` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `executers`
--

DROP TABLE IF EXISTS `executers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `executers` (
  `uid` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `description` varchar(100) DEFAULT NULL,
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `changed` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `name_UNIQUE` (`name`),
  KEY `key_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `executers`
--

LOCK TABLES `executers` WRITE;
/*!40000 ALTER TABLE `executers` DISABLE KEYS */;
INSERT INTO `executers` VALUES (4,'БПО','','2019-01-24 10:14:34','2019-01-24 10:14:34'),(5,'ЦРС','','2019-01-24 10:14:43','2019-01-24 10:14:43'),(6,'ЛПДС Песь','','2019-07-25 14:41:33','2019-07-25 14:41:33');
/*!40000 ALTER TABLE `executers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `history`
--

DROP TABLE IF EXISTS `history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `history` (
  `UID` int NOT NULL AUTO_INCREMENT,
  `ACTIONDATETIME` datetime NOT NULL,
  `USERNAME` varchar(20) NOT NULL,
  `DESCRIPTION` char(255) NOT NULL,
  `RECORDCONTENT` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`UID`),
  UNIQUE KEY `HST_KEY_UID` (`UID`)
) ENGINE=InnoDB AUTO_INCREMENT=1168 DEFAULT CHARSET=cp1251;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `history`
--

LOCK TABLES `history` WRITE;
/*!40000 ALTER TABLE `history` DISABLE KEYS */;
INSERT INTO `history` VALUES (682,'2018-11-09 16:11:54','','Отсутствует учетная запись администратора системы',NULL),(683,'2018-11-09 16:11:55','','Добавлена учетная запись \"admin\" с паролем по умолчанию',NULL),(684,'2018-11-09 16:12:24','','Ошибка аутентификации пользователя admin',''),(685,'2018-11-09 16:12:29','','Ошибка аутентификации пользователя admin',''),(686,'2018-11-09 16:13:25','','Ошибка аутентификации пользователя admin',''),(687,'2018-11-09 16:13:32','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(688,'2018-11-09 16:13:32','','Пользователю pavlovob отказано в доступе',''),(689,'2018-11-09 16:15:03','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(690,'2018-11-09 16:15:03','','Пользователю pavlovob отказано в доступе',''),(691,'2018-11-09 16:15:05','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(692,'2018-11-09 16:15:05','','Пользователю pavlovob отказано в доступе',''),(693,'2018-11-09 16:15:12','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(694,'2018-11-09 16:15:12','','Пользователю pavlovob отказано в доступе',''),(695,'2018-11-09 16:15:17','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(696,'2018-11-09 16:15:17','','Пользователю pavlovob отказано в доступе',''),(697,'2018-11-09 16:15:45','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(698,'2018-11-09 16:15:45','','Пользователю pavlovob отказано в доступе',''),(699,'2018-11-09 16:15:57','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(700,'2018-11-09 16:15:57','','Пользователю pavlovob отказано в доступе',''),(701,'2018-11-09 16:21:58','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(702,'2018-11-09 16:21:58','','В справочник пользователей добавлена учетная запись pavlovob',''),(703,'2018-11-09 16:21:58','','Пользователю pavlovob предоставлен доступ',''),(704,'2018-11-29 11:51:10','','Ошибка аутентификации пользователя pavlovob',''),(705,'2018-11-29 11:51:19','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(706,'2018-11-29 11:51:55','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(707,'2018-11-29 11:51:55','','Пользователю pavlovob предоставлен доступ',''),(708,'2018-11-29 12:10:46','','Ошибка аутентификации пользователя pavlovob',''),(709,'2018-11-29 12:10:51','','Ошибка аутентификации пользователя pavlovob',''),(710,'2018-11-29 12:11:00','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(711,'2018-11-29 12:11:00','','Пользователю pavlovob предоставлен доступ',''),(712,'2018-11-29 12:11:44','','Добавлена настройка (common/orgname)',''),(713,'2018-11-29 12:11:44','','Добавлена настройка (committee/s1f)',''),(714,'2018-11-29 12:11:44','','Добавлена настройка (committee/s1p)',''),(715,'2018-11-29 12:11:44','','Добавлена настройка (committee/w1f)',''),(716,'2018-11-29 12:11:44','','Добавлена настройка (committee/w1p)',''),(717,'2018-11-29 12:11:44','','Добавлена настройка (committee/w2f)',''),(718,'2018-11-29 12:11:44','','Добавлена настройка (committee/w2p)',''),(719,'2018-11-29 12:11:44','','Добавлена настройка (committee/dsc)',''),(720,'2018-11-29 12:11:44','','Добавлена настройка (serviceact/autonumber)',''),(721,'2018-11-29 12:11:44','','Добавлена настройка (serviceact/contract)',''),(722,'2018-11-29 12:11:44','','Добавлена настройка (reports/accountcharid)',''),(723,'2019-01-09 15:34:45','','Ошибка аутентификации пользователя pavlovob',''),(724,'2019-01-09 15:34:51','','Ошибка аутентификации пользователя pavlovob',''),(725,'2019-01-09 15:35:06','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(726,'2019-01-09 15:35:07','','Пользователю pavlovob предоставлен доступ',''),(727,'2019-01-18 12:13:20','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(728,'2019-01-18 12:13:20','','Пользователю pavlovob предоставлен доступ',''),(729,'2019-01-18 12:28:56','','Удален пользователь',NULL),(730,'2019-01-18 12:29:01','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(731,'2019-01-18 12:29:01','','В справочник пользователей добавлена учетная запись pavlovob',''),(732,'2019-01-18 12:30:52','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(733,'2019-01-18 12:30:52','','Пользователю pavlovob предоставлен доступ',''),(734,'2019-01-18 12:37:38','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(735,'2019-01-18 12:38:04','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(736,'2019-01-18 12:39:01','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(737,'2019-01-18 12:40:02','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(738,'2019-01-18 12:40:02','','Пользователю pavlovob предоставлен доступ',''),(739,'2019-01-18 13:34:14','','Удален пользователь',NULL),(740,'2019-01-18 13:34:16','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(741,'2019-01-18 13:34:51','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(742,'2019-01-18 13:34:51','','В справочник пользователей добавлена учетная запись pavlovob',''),(743,'2019-01-18 13:34:51','','Пользователю pavlovob предоставлен доступ',''),(744,'2019-01-18 13:41:42','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(745,'2019-01-18 13:41:42','','Пользователю pavlovob предоставлен доступ',''),(746,'2019-01-18 13:44:05','','Удален пользователь',NULL),(747,'2019-01-18 13:44:07','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(748,'2019-01-18 13:44:08','','В справочник пользователей добавлена учетная запись pavlovob (Павлов Олег Борисович)',''),(749,'2019-01-18 13:44:08','','Пользователю pavlovob предоставлен доступ',''),(750,'2019-01-18 13:44:55','','Ошибка аутентификации пользователя pavlovob1',''),(751,'2019-01-18 13:45:13','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(752,'2019-01-18 13:45:13','','Пользователю pavlovob предоставлен доступ к ИС',''),(753,'2019-01-18 13:46:07','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(754,'2019-01-18 13:46:07','','Пользователю pavlovob предоставлен доступ к ИС',''),(755,'2019-01-18 13:48:39','','Пользователь вышел из системы.',''),(756,'2019-01-18 13:48:46','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(757,'2019-01-18 13:48:46','','Пользователю pavlovob предоставлен доступ к ИС',''),(758,'2019-01-18 13:49:03','','Пользователь вышел из системы.',''),(759,'2019-01-18 13:49:06','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(760,'2019-01-18 13:49:06','','Пользователю pavlovob предоставлен доступ к ИС',''),(761,'2019-01-18 13:49:42','','Пользователь вышел из ИС',''),(762,'2019-01-18 13:49:45','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(763,'2019-01-18 13:49:45','','Пользователю pavlovob предоставлен доступ к ИС',''),(764,'2019-01-18 13:50:18','','Удален пользователь',NULL),(765,'2019-01-18 13:52:29','','Отсутствует учетная запись администратора системы',NULL),(766,'2019-01-18 13:54:46','','Пользователь вышел из ИС',''),(767,'2019-01-18 13:54:46','','Отсутствует учетная запись администратора системы. Будет добавлена.',''),(768,'2019-01-18 13:54:46','','Добавлена учетная запись \"admin\" с паролем по умолчанию',NULL),(769,'2019-01-18 13:54:49','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(770,'2019-01-18 13:54:49','','Пользователю pavlovob предоставлен доступ к ИС',''),(771,'2019-01-18 13:55:32','','Пользователь вышел из ИС',''),(772,'2019-01-18 13:55:41','','Ошибка аутентификации пользователя admin',''),(773,'2019-01-18 13:56:37','','Ошибка аутентификации пользователя admin',''),(774,'2019-01-18 13:56:45','','Ошибка аутентификации пользователя admin',''),(775,'2019-01-18 13:56:52','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(776,'2019-01-18 13:56:53','','Пользователю pavlovob предоставлен доступ к ИС',''),(777,'2019-01-18 13:57:01','','Удален пользователь',NULL),(778,'2019-01-18 13:57:04','','Пользователь вышел из ИС',''),(779,'2019-01-18 13:57:04','','Отсутствует учетная запись администратора системы. Будет добавлена.',''),(780,'2019-01-18 13:57:05','','Добавлена учетная запись \"admin\" с паролем по умолчанию',NULL),(781,'2019-01-18 13:57:08','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(782,'2019-01-18 13:57:08','','Пользователю pavlovob предоставлен доступ к ИС',''),(783,'2019-01-18 13:57:22','','Пользователь вышел из ИС',''),(784,'2019-01-18 13:57:28','','Ошибка аутентификации пользователя admin',''),(785,'2019-01-18 13:58:32','','Доступ к системе предоставлен.',''),(786,'2019-01-18 15:20:56','','Пользователь вышел из ИС',''),(787,'2019-01-18 15:20:58','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(788,'2019-01-18 15:20:59','','Пользователю pavlovob предоставлен доступ к ИС',''),(789,'2019-01-18 15:21:19','','Пользователь вышел из ИС',''),(790,'2019-01-18 15:22:04','','Ошибка аутентификации пользователя scanyrnu',''),(791,'2019-01-18 15:22:09','','Пользователь scanyrnu прошел аутентификацию в домене SPB-TN',''),(792,'2019-01-18 15:22:09','','Пользователю scanyrnu отказано в доступе',''),(793,'2019-01-18 15:22:25','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(794,'2019-01-18 15:22:25','','Пользователю pavlovob предоставлен доступ к ИС',''),(795,'2019-01-18 15:23:57','','Пользователь вышел из ИС',''),(796,'2019-01-18 15:24:07','','Ошибка аутентификации пользователя scanyrn',''),(797,'2019-01-18 15:24:11','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(798,'2019-01-18 15:24:11','','Пользователю pavlovob предоставлен доступ к ИС',''),(799,'2019-01-18 15:24:23','','Пользователь вышел из ИС',''),(800,'2019-01-18 15:24:33','','Пользователь scanyrnu прошел аутентификацию в домене SPB-TN',''),(801,'2019-01-18 15:24:33','','Пользователю scanyrnu отказано в доступе к ИС. Проверьте членство в группе 4 Пользователи ИС Поручения (Пользователь)',''),(802,'2019-01-18 15:25:30','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(803,'2019-01-18 15:25:30','','Пользователю pavlovob предоставлен доступ к ИС',''),(804,'2019-01-18 16:01:13','','Удален пользователь',NULL),(805,'2019-01-18 16:01:15','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(806,'2019-01-18 16:01:15','','В справочник пользователей добавлена учетная запись pavlovob (Павлов Олег Борисович)',''),(807,'2019-01-18 16:01:15','','Пользователю pavlovob предоставлен доступ к ИС',''),(808,'2019-01-18 16:04:04','','Удален пользователь Павлов Олег Борисович',NULL),(809,'2019-01-18 16:04:06','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(810,'2019-01-18 16:04:06','','В справочник пользователей добавлена учетная запись pavlovob (Павлов Олег Борисович)',''),(811,'2019-01-18 16:04:06','','Пользователю pavlovob предоставлен доступ к ИС',''),(812,'2019-01-18 16:10:11','','Удален пользователь Павлов Олег Борисович',NULL),(813,'2019-01-18 16:10:13','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(814,'2019-01-18 16:10:13','','В справочник пользователей добавлена учетная запись pavlovob (Павлов Олег Борисович)',''),(815,'2019-01-18 16:10:13','','Пользователю pavlovob предоставлен доступ к ИС',''),(816,'2019-01-18 16:10:23','','Удален пользователь Администратор системы',NULL),(817,'2019-01-18 16:10:23','','Пользователь вышел из ИС',''),(818,'2019-01-18 16:10:24','','Отсутствует учетная запись администратора системы. Будет добавлена.',''),(819,'2019-01-18 16:10:24','','Добавлена учетная запись \"admin\" с паролем по умолчанию',NULL),(820,'2019-01-18 16:10:26','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(821,'2019-01-18 16:10:26','','Пользователю pavlovob предоставлен доступ к ИС',''),(822,'2019-01-18 16:11:47','','Пользователь вышел из ИС',''),(823,'2019-01-18 16:11:50','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(824,'2019-01-18 16:11:50','','Пользователю pavlovob предоставлен доступ к ИС',''),(825,'2019-01-23 12:08:13','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(826,'2019-01-23 12:08:13','','Пользователю pavlovob предоставлен доступ к ИС',''),(827,'2019-01-23 14:18:22','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(828,'2019-01-23 15:30:51','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(829,'2019-01-23 15:43:45','','Добавлен новый курирующий отдел: qwefewqfq1','qwefewqfq1, , 4'),(830,'2019-01-23 15:48:40','','Отредактирован курирующий отдел: qwefewqfq1','4, hfuer890284ji4fq34, , 2019-01-23 15:43:45, 2019-01-23 15:43:45'),(831,'2019-01-23 15:52:05','','Отредактирован курирующий отдел: 2hnd48-12k8-30','4, 2hnd48-12k8-30, , 2019-01-23 15:43:45, 2019-01-23 15:52:05'),(832,'2019-01-23 15:55:22','','Удален курирующий отдел: 2hnd48-12k8-30','4, 2hnd48-12k8-30, , 2019-01-23 15:43:45, 2019-01-23 15:52:05'),(833,'2019-01-23 16:04:19','','Удален курирующий отдел: qwefewqfq','3, qwefewqfq, , 2019-01-23 15:43:15, 2019-01-23 15:43:15'),(834,'2019-01-23 16:04:23','','Добавлен новый курирующий отдел: цукпукцпреку','цукпукцпреку, , 5'),(835,'2019-01-23 16:04:28','','Отредактирован курирующий отдел: цукпукцпреку','5, 3412543йфукап, , 2019-01-23 16:04:23, 2019-01-23 16:04:28'),(836,'2019-01-23 16:04:30','','Удален курирующий отдел: 3412543йфукап','5, 3412543йфукап, , 2019-01-23 16:04:23, 2019-01-23 16:04:28'),(837,'2019-01-23 16:08:55','','Добавлен новый курирующий отдел: цукпыукакйцуке23е2','цукпыукакйцуке23е2, , 6'),(838,'2019-01-23 16:09:00','','Отредактирован курирующий отдел: цукпыукакйцуке23е2','6, 2а4к4ка32к4, , 2019-01-23 16:08:55, 2019-01-23 16:09:00'),(839,'2019-01-23 16:09:04','','Отредактирован курирующий отдел: 2а4к4ка32к4','6, 2а4к4ка32к4, цмкеуиигв6н54н, 2019-01-23 16:08:55, 2019-01-23 16:09:04'),(840,'2019-01-23 16:09:11','','Удален курирующий отдел: 2а4к4ка32к4','6, 2а4к4ка32к4, цмкеуиигв6н54н, 2019-01-23 16:08:55, 2019-01-23 16:09:04'),(841,'2019-01-24 10:08:33','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(842,'2019-01-24 10:08:33','','Пользователю pavlovob предоставлен доступ к ИС',''),(843,'2019-01-24 10:13:44','','Добавлено новое подразделение-исполнитель: БПО','БПО, , 3'),(844,'2019-01-24 10:13:56','','Отредактировано подразделение-исполнитель: БПО','3, ЦРС, цлзполцщшпшщзцор, 2019-01-24 10:13:44, 2019-01-24 10:13:56'),(845,'2019-01-24 10:14:23','','Удалено подразделение-исполнитель: ЦРС','3, ЦРС, цлзполцщшпшщзцор, 2019-01-24 10:13:44, 2019-01-24 10:13:56'),(846,'2019-01-24 10:14:34','','Добавлено новое подразделение-исполнитель: БПО','БПО, , 4'),(847,'2019-01-24 10:14:43','','Добавлено новое подразделение-исполнитель: ЦРС','ЦРС, , 5'),(848,'2019-01-24 11:17:46','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(849,'2019-01-24 11:20:11','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(850,'2019-01-24 11:24:18','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(851,'2019-01-24 11:26:50','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(852,'2019-01-24 11:27:02','','Отредактированы данные пользователя Администратор системы (локальный вход)',NULL),(853,'2019-01-25 11:18:29','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(854,'2019-01-25 11:18:30','','Пользователю pavlovob предоставлен доступ к ИС',''),(855,'2019-01-25 11:21:07','','Пользователь вышел из ИС',''),(856,'2019-01-25 11:24:41','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(857,'2019-01-25 11:24:41','','Пользователю pavlovob предоставлен доступ к ИС',''),(858,'2019-01-25 14:00:31','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(859,'2019-01-25 15:00:24','','Пользователь вышел из ИС',''),(860,'2019-01-25 15:00:26','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(861,'2019-01-25 15:00:26','','Пользователю pavlovob предоставлен доступ к ИС',''),(862,'2019-01-25 15:02:34','','Добавлена настройка (common/chief_post)',''),(863,'2019-01-25 15:02:34','','Добавлена настройка (common/chief_name)',''),(864,'2019-01-25 15:02:40','','Удалена настройка (common/orgname)',''),(865,'2019-01-25 15:02:40','','Добавлена настройка (common/orgname)',''),(866,'2019-01-25 15:02:42','','Удалена настройка (committee/s1f)',''),(867,'2019-01-25 15:02:43','','Удалена настройка (committee/s1p)',''),(868,'2019-01-25 15:02:43','','Удалена настройка (committee/w1f)',''),(869,'2019-01-25 15:02:44','','Удалена настройка (committee/w1p)',''),(870,'2019-01-25 15:02:45','','Удалена настройка (committee/w2f)',''),(871,'2019-01-25 15:02:45','','Удалена настройка (committee/w2p)',''),(872,'2019-01-25 15:02:46','','Удалена настройка (committee/dsc)',''),(873,'2019-01-25 15:02:47','','Удалена настройка (serviceact/autonumber)',''),(874,'2019-01-25 15:02:48','','Удалена настройка (serviceact/contract)',''),(875,'2019-01-25 15:02:49','','Удалена настройка (reports/accountcharid)',''),(876,'2019-01-25 15:02:49','','Удалена настройка (common/chief_post)',''),(877,'2019-01-25 15:02:50','','Добавлена настройка (common/chief_post)',''),(878,'2019-01-25 15:02:50','','Удалена настройка (common/chief_name)',''),(879,'2019-01-25 15:02:50','','Добавлена настройка (common/chief_name)',''),(880,'2019-01-25 15:02:51','','Удалена настройка (common/orgname)',''),(881,'2019-01-25 15:02:51','','Добавлена настройка (common/orgname)',''),(882,'2019-01-25 15:02:52','','Удалена настройка (common/chief_post)',''),(883,'2019-01-25 15:02:52','','Добавлена настройка (common/chief_post)',''),(884,'2019-01-25 15:02:53','','Удалена настройка (common/chief_name)',''),(885,'2019-01-25 15:02:53','','Добавлена настройка (common/chief_name)',''),(886,'2019-01-25 15:02:54','','Удалена настройка (common/orgname)',''),(887,'2019-01-25 15:02:54','','Добавлена настройка (common/orgname)',''),(888,'2019-01-25 15:02:54','','Удалена настройка (common/chief_post)',''),(889,'2019-01-25 15:02:55','','Добавлена настройка (common/chief_post)',''),(890,'2019-01-25 15:02:55','','Удалена настройка (common/chief_name)',''),(891,'2019-01-25 15:02:55','','Добавлена настройка (common/chief_name)',''),(892,'2019-01-25 15:02:57','','Удалена настройка (common/orgname)',''),(893,'2019-01-25 15:02:57','','Добавлена настройка (common/orgname)',''),(894,'2019-01-25 15:02:58','','Удалена настройка (common/chief_post)',''),(895,'2019-01-25 15:02:58','','Добавлена настройка (common/chief_post)',''),(896,'2019-01-25 15:03:00','','Удалена настройка (common/chief_name)',''),(897,'2019-01-25 15:03:00','','Добавлена настройка (common/chief_name)',''),(898,'2019-01-25 15:03:26','','Отредактирована настройка (common/orgname) на Ярославское РНУ',''),(899,'2019-01-25 15:03:44','','Отредактирована настройка (common/chief_post) на Начальник Ярославского РНУ',''),(900,'2019-01-25 15:03:52','','Отредактирована настройка (common/chief_name) на П.В. Ростов',''),(901,'2019-03-12 12:55:11','','Ошибка аутентификации пользователя pavlovob',''),(902,'2019-03-12 12:55:16','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(903,'2019-03-12 12:55:16','','Пользователю pavlovob предоставлен доступ к ИС',''),(904,'2019-05-23 08:13:41','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(905,'2019-05-23 08:13:41','','Пользователю pavlovob предоставлен доступ к ИС',''),(906,'2019-05-24 09:50:49','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(907,'2019-05-24 09:50:50','','Пользователю pavlovob предоставлен доступ к ИС',''),(908,'2019-07-19 11:04:23','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(909,'2019-07-19 11:04:24','','Пользователю pavlovob предоставлен доступ к ИС',''),(910,'2019-07-19 12:06:09','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(911,'2019-07-19 12:19:48','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(912,'2019-07-19 12:22:50','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(913,'2019-07-19 12:23:21','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(914,'2019-07-19 12:25:09','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(915,'2019-07-19 12:25:27','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(916,'2019-07-19 12:29:03','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(917,'2019-07-19 12:47:58','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(918,'2019-07-19 12:48:08','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(919,'2019-07-19 12:51:33','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(920,'2019-07-19 12:52:39','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(921,'2019-07-19 14:15:29','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(922,'2019-07-19 14:16:09','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(923,'2019-07-19 14:37:08','','Добавлено поручение','uowfhqweiuhfiuh, p0qwoejfperijworji, 5'),(924,'2019-07-19 14:37:29','','Добавлено поручение','uowfhqweiuhfiuh, p0qwoejfperijworji, 5'),(925,'2019-07-19 14:39:50','','Добавлено поручение','rhetyjhrtyj, p0qwoejfperijworji, 5'),(926,'2019-07-19 14:50:38','','Добавлено поручение','opwijgojtrgo;i, o;ierjgioejrg, 5'),(927,'2019-07-19 14:51:58','','Добавлено поручение','1, woeifjo, fweoifjwioj, 5'),(928,'2019-07-19 14:52:52','','Добавлено поручение','1, 26.08, ;pqwoefjkqopwergjero;igj;oqeij, p;iowerjg;iowerjgio;werjgor, 5'),(929,'2019-07-19 14:54:41','','Добавлено поручение','1, 26.08, ;pqwoefjkqopwergjero;igj;oqeij, p;iowerjg;iowerjgio;werjgor, 5, 1'),(930,'2019-07-19 14:59:27','','Добавлено поручение','1, 4, 09.05, зушщкползцушщокпщшцок, зщукпзцукщпозцщорп, 5, 1'),(931,'2019-07-19 15:01:41','','Добавлено поручение','2, 4, wwefwer, rgwegwer, ergwergw, 5, 1'),(932,'2019-07-19 15:02:49','','Добавлено поручение','21, 4, qwef, qwef, qwef, 5, 1'),(933,'2019-07-19 15:34:48','','Добавлено поручение',', , , , , , , 5, 1'),(934,'2019-07-19 15:35:43','','Добавлено поручение',', , , , , , , 5, 1'),(935,'2019-07-19 15:38:18','','Добавлено поручение','4, 1, 0980980, oqiwuejhf;onjio;nein, joweifjwoie, oiwjefoiwjefo, poqwoperj]0F\'JKZSOPEJG, 5, 1'),(936,'2019-07-19 15:46:05','','Добавлено поручение','4, werg, 1235345, esrgsergwe, wrthrth, rthtre, hrtrt, 7, 1'),(937,'2019-07-19 16:14:31','','Добавлено поручение','4, 1, 30.05, \"Устранение дефектов выборочным ремонтом на ЛЧ МТ с учетом МСГ ООО \"\"АПМК-Билдинг\"\", ООО \"\"СпецСтрой, Горчаков С.М., Кирнос А.В., , 7, 1'),(938,'2019-07-19 16:37:33','','Добавлено поручение','4, 2, 30.04, Представить  утвержденный гл.инженером РНУ  суточно-месячный график устранения дефектов на ЛЧ МТ на , Горчаков С.М., Кирнос А.В., , 7, 1'),(939,'2019-07-24 12:49:31','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(940,'2019-07-24 12:49:31','','Пользователю pavlovob предоставлен доступ к ИС',''),(941,'2019-07-25 07:55:42','','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',''),(942,'2019-07-25 07:55:43','','Пользователю pavlovob предоставлен доступ к ИС',''),(943,'2019-07-25 14:40:27','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(944,'2019-07-25 14:40:38','','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(945,'2019-07-25 14:41:33','','Добавлено новое подразделение-исполнитель: ЛПДС Песь','ЛПДС Песь, , 6'),(946,'2019-07-25 14:53:08','','Добавлено поручение','6, 1, 04.07, ОР2 Устранение отказа с выходом нефти на водной поверхности при отсутствии ледяных образований (локализация и ликвидация разлива), Алехин А.А., Секацкий Д.В., , 7, 1'),(947,'2019-10-24 15:22:03','pavlovob','Пользователь вышел из ИС',NULL),(948,'2019-10-24 15:22:06','Не определен','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',NULL),(949,'2019-10-24 15:24:50','pavlovob','Пользователь pavlovob прошел аутентификацию в домене SPB-TN','**'),(950,'2019-10-24 15:24:57','pavlovob','Пользователь вышел из ИС',NULL),(951,'2019-10-24 15:25:01','Не определен','Пользователь pavlovob прошел аутентификацию в домене SPB-TN','**'),(952,'2019-10-24 15:26:13','pavlovob','Пользователь вышел из ИС',NULL),(953,'2019-10-24 15:26:16','Не определен','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',NULL),(954,'2019-10-24 15:26:43','pavlovob','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',NULL),(955,'2019-10-24 15:28:00','pavlovob','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',NULL),(956,'2019-10-24 15:28:00','pavlovob','Пользователю pavlovob предоставлен доступ к ИС',NULL),(957,'2019-10-24 15:28:03','pavlovob','Пользователь вышел из ИС',NULL),(958,'2019-10-24 15:28:06','Не определен','Пользователь pavlovob прошел аутентификацию в домене SPB-TN',NULL),(959,'2019-10-24 15:28:06','pavlovob','Пользователю pavlovob предоставлен доступ к ИС',NULL),(960,'2019-10-24 15:31:21','pavlovob','Отредактированы данные пользователя Павлов Олег Борисович',NULL),(961,'2019-10-24 16:29:24','pavlovob','Добавлено поручение',', Иваненко Б.Н., 1, Ежедневно, As a rule of thumb, you should never trust the data received from end users and should always validate it before putting it to good use.\r\n\r\nGiven a model populated with user inputs, you can validate the inputs by calling the yii\\base\\Model::validate() method. The method will return a boolean value indicating whether the validation succeeded or not. If not, you may get the error messages from the yii\\base\\Model::$errors property. For example,, Павлов О.Б., , 7, 1'),(962,'2019-10-25 11:48:34','pavlovob','Добавлен новый работник pwojkefopkjwepfko',NULL),(963,'2019-10-25 11:48:38','pavlovob','Добавлен новый работник oqoiwjd',NULL),(964,'2019-10-25 11:50:18','pavlovob','Добавлен новый работник qowkglkse;rgl',NULL),(965,'2019-10-25 11:50:27','pavlovob','Добавлен новый работник qoweifq\'rgjq',NULL),(966,'2019-10-25 11:52:58','pavlovob','Отредактированы данные работника',', 781074290812735089, 2019-10-25 11:48:34, 2019-10-25 11:52:58'),(967,'2019-10-25 11:53:05','pavlovob','Удален работник',', 781074290812735089, 2019-10-25 11:48:34, 2019-10-25 11:52:58'),(968,'2019-10-25 11:54:30','pavlovob','Удален работник oqoiwjd',', oqoiwjd, 2019-10-25 11:48:38, 2019-10-25 11:48:38'),(969,'2019-10-25 11:59:49','pavlovob','Отредактированы данные работника wefgijweogjieiorg',', wefgijweogjieiorg, 2019-10-25 11:50:27, 2019-10-25 11:59:49'),(970,'2019-10-25 16:41:14','pavlovob','Удален работник wefgijweogjieiorg',', wefgijweogjieiorg, 2019-10-25 11:50:27, 2019-10-25 11:59:49'),(971,'2021-01-27 16:41:53','pavlovob','Пользователь завершил работу в ИС',NULL),(972,'2021-01-27 16:42:00','Система','Указанная учетная запись не является пользовательской',NULL),(973,'2021-01-27 16:42:04','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.',NULL),(974,'2021-01-27 16:42:10','pavlovob','Пользователю предоставлен доступ',NULL),(975,'2021-01-27 16:45:56','pavlovob','Пользователь завершил работу в ИС',NULL),(976,'2021-01-27 16:45:59','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','gorchakovsm|Горчаков Сергей Михайлович'),(977,'2021-01-27 16:46:03','pavlovob','Пользователю предоставлен доступ',NULL),(978,'2021-01-27 16:48:18','pavlovob','Пользователь завершил работу в ИС',NULL),(979,'2021-01-27 16:48:21','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(980,'2021-01-27 16:48:42','pavlovob','Пользователь завершил работу в ИС',NULL),(981,'2021-01-27 16:48:49','Система','Указанная учетная запись не является пользовательской','scanyrnu'),(982,'2021-01-27 16:48:58','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(983,'2021-01-27 16:50:36','pavlovob','Пользователь завершил работу в ИС',NULL),(984,'2021-01-27 16:50:42','Система','Неправильное имя пользователя или пароль','123'),(985,'2021-01-27 16:51:00','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(986,'2021-01-28 12:54:07','pavlovob','Пользователь завершил работу в ИС',NULL),(987,'2021-01-28 12:54:11','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','gorchakovsm-Горчаков Сергей Михайлович'),(988,'2021-01-28 12:54:15','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(989,'2021-01-28 12:54:43','pavlovob','Пользователь завершил работу в ИС',NULL),(990,'2021-01-28 12:54:47','Система','Неправильное имя пользователя или пароль','123'),(991,'2021-01-28 12:54:52','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(992,'2021-02-02 14:22:04','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','gorchakovsm-Горчаков Сергей Михайлович'),(993,'2021-02-02 14:22:17','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(994,'2021-02-02 16:33:44','pavlovob','Пользователь завершил работу в ИС',NULL),(995,'2021-02-02 16:35:05','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(996,'2021-02-02 16:42:39','pavlovob','Пользователь завершил работу в ИС',NULL),(997,'2021-02-02 16:42:49','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(998,'2021-02-18 15:48:46','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','gorchakovsm-Горчаков Сергей Михайлович'),(999,'2021-02-18 15:48:54','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1000,'2021-02-18 16:43:44','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1001,'2021-04-05 09:29:36','Система','Неправильное имя пользователя или пароль','pavlovob'),(1002,'2021-04-05 09:29:42','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1003,'2021-04-09 16:16:27','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1004,'2021-04-13 12:02:14','Система','Неправильное имя пользователя или пароль','qwef'),(1005,'2021-04-13 13:33:16','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1006,'2021-04-14 11:24:07','Система','Неправильное имя пользователя или пароль','pavlovob'),(1007,'2021-04-14 11:24:10','Система','Неправильное имя пользователя или пароль','pavlovob1'),(1008,'2021-04-14 11:25:13','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1009,'2021-04-14 11:25:58','pavlovob','Пользователь завершил работу в ИС',NULL),(1010,'2021-04-14 11:26:07','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','pavlovob-Павлов Олег Борисович'),(1011,'2021-04-14 11:27:20','Система','Неправильное имя пользователя или пароль','qwe'),(1012,'2021-04-14 11:27:27','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','pavlovob-Павлов Олег Борисович'),(1013,'2021-04-14 11:29:05','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','pavlovob-Павлов Олег Борисович'),(1014,'2021-04-14 11:40:35','Система','Неправильное имя пользователя или пароль','uferevsn'),(1015,'2021-04-14 11:40:46','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','uferevsn-Юферев Сергей Николаевич'),(1016,'2021-04-14 11:41:09','uferevsn','Пользователю предоставлен доступ','Юферев Сергей Николаевич'),(1017,'2021-04-14 11:41:24','uferevsn','Пользователь завершил работу в ИС',NULL),(1018,'2021-04-14 11:44:29','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','pavlovob-Павлов Олег Борисович'),(1019,'2021-04-14 11:44:59','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1020,'2021-04-14 12:00:45','pavlovob','Пользователь завершил работу в ИС',NULL),(1021,'2021-04-14 12:00:53','Система','Неправильное имя пользователя или пароль','e'),(1022,'2021-04-14 13:19:55','Система','Неправильное имя пользователя или пароль','зфмдщмщ'),(1023,'2021-04-14 13:19:58','Система','Неправильное имя пользователя или пароль','pavlovob'),(1024,'2021-04-14 13:20:03','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1025,'2021-04-14 14:04:26','pavlovob','Пользователь завершил работу в ИС',NULL),(1026,'2021-04-14 14:04:35','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1027,'2021-04-14 15:35:36','uferevsn','Пользователю предоставлен доступ','Юферев Сергей Николаевич'),(1028,'2021-04-15 13:26:36','Система','Неправильное имя пользователя или пароль','pavlovob'),(1029,'2021-04-15 13:26:42','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1030,'2021-04-15 13:27:06','pavlovob','Пользователь завершил работу в ИС',NULL),(1031,'2021-04-15 13:27:12','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1032,'2021-04-15 13:27:28','Система','Неправильное имя пользователя или пароль','pavlovob'),(1033,'2021-04-15 13:27:34','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1034,'2021-04-20 14:49:30','pavlovob','Созданы поручения на 2021-05-01','2021-05-01;1;2;3;4;1002;8'),(1035,'2021-04-20 14:53:45','pavlovob','Созданы поручения на 1619816400','2021-05-01;qwer;fgrewg;;;1001;12'),(1036,'2021-04-20 14:55:18','pavlovob','Созданы поручения на 5','2021-05-01;q;q;;;1001;13'),(1037,'2021-04-20 14:56:31','pavlovob','Созданы поручения на май','2021-05-01;3;3;;;1001;15'),(1038,'2021-04-20 14:58:12','pavlovob','Созданы поручения на май 2021 года','2021-05-01;к;к;;;1001;16'),(1039,'2021-04-20 15:29:25','pavlovob','Добавлена настройка (committee/s1f)',NULL),(1040,'2021-04-20 15:29:25','pavlovob','Добавлена настройка (committee/s1p)',NULL),(1041,'2021-04-20 15:31:41','pavlovob','SYSTEM','Удалена настройка (common/orgname)'),(1042,'2021-04-20 15:31:44','pavlovob','SYSTEM','Удалена настройка (common/chief_post)'),(1043,'2021-04-20 15:31:47','pavlovob','SYSTEM','Удалена настройка (common/chief_name)'),(1044,'2021-04-20 15:31:50','pavlovob','SYSTEM','Удалена настройка (committee/s1f)'),(1045,'2021-04-20 15:31:50','pavlovob','Добавлена настройка (committee/s1f)',NULL),(1046,'2021-04-20 15:31:53','pavlovob','SYSTEM','Удалена настройка (committee/s1p)'),(1047,'2021-04-20 15:31:53','pavlovob','Добавлена настройка (committee/s1p)',NULL),(1048,'2021-04-20 15:31:55','pavlovob','SYSTEM','Удалена настройка (committee/s1f)'),(1049,'2021-04-20 15:31:55','pavlovob','Добавлена настройка (committee/s1f)',NULL),(1050,'2021-04-20 15:31:58','pavlovob','SYSTEM','Удалена настройка (committee/s1p)'),(1051,'2021-04-20 15:31:58','pavlovob','Добавлена настройка (committee/s1p)',NULL),(1052,'2021-04-20 15:38:43','pavlovob','Добавлена настройка (common/orgname)',NULL),(1053,'2021-04-20 15:40:02','pavlovob','Отредактирована настройка (committee/s1f) на qewfqewfq',''),(1054,'2021-04-20 15:40:28','pavlovob','Удалена настройка (committee/s1f)',''),(1055,'2021-04-20 15:40:28','pavlovob','Добавлена настройка (committee/s1f)',NULL),(1056,'2021-04-20 15:41:56','pavlovob','Отредактирована настройка (committee/s1p) на qoiewjfoiwejfoiqwe',''),(1057,'2021-04-20 15:42:02','pavlovob','Отредактирована настройка (common/orgname) на qwertyuiop[]',''),(1058,'2021-04-20 15:42:07','pavlovob','Отредактирована настройка (committee/s1f) на \\\';lkjhgfdsa',''),(1059,'2021-04-20 15:55:24','pavlovob','Созданы поручения на май 2021 года','2021-05-01;r;r;;;1001;17'),(1060,'2021-04-20 15:56:38','pavlovob','Созданы поручения на май 2021 года','2021-05-01;3;23;;;1001;18'),(1061,'2021-04-21 10:02:22','pavlovob','Созданы поручения на май 2021 года','2021-05-01;1;2134;1234;;1001;19'),(1062,'2021-04-21 10:10:19','pavlovob','Созданы поручения на май 2021 года','2021-05-01;1;23;3;;1001;20'),(1063,'2021-04-22 10:40:21','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1064,'2021-05-12 09:58:34','Система','Неправильное имя пользователя или пароль','1'),(1065,'2021-05-12 09:58:40','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1066,'2021-05-12 09:59:43','pavlovob','Отредактирована настройка (committee/s1p) на Главный инженер',''),(1067,'2021-05-12 09:59:52','pavlovob','Отредактирована настройка (common/orgname) на Ярославское РНУ',''),(1068,'2021-05-12 10:00:01','pavlovob','Отредактирована настройка (committee/s1f) на Горчаков С.М.',''),(1069,'2021-05-12 10:11:55','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;2;;;1001;21'),(1070,'2021-05-12 10:12:18','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;1;1;1;1001;22'),(1071,'2021-05-12 10:13:30','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;2;3;4;;1001;23'),(1072,'2021-05-12 10:13:46','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;3;1234;;1001;24'),(1073,'2021-05-12 10:14:38','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;3;к;3;;1001;25'),(1074,'2021-05-12 10:15:20','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;3;3;;1001;26'),(1075,'2021-05-12 10:18:19','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;3;3;;1001;27'),(1076,'2021-05-12 10:26:42','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;23;4;;1001;28'),(1077,'2021-05-12 10:31:54','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;3;23;4;;1001;29'),(1078,'2021-05-12 10:38:04','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;2;23;4;;1001;30'),(1079,'2021-05-12 10:39:10','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;2;23;4;;1001;31'),(1080,'2021-05-12 10:53:02','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;3;4;;1001;32'),(1081,'2021-05-12 10:54:33','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;3;4;;1001;33'),(1082,'2021-05-12 10:58:00','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;3;23;3;;1001;34'),(1083,'2021-05-12 10:58:47','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;2;3;;;1001;35'),(1084,'2021-05-12 11:08:09','pavlovob','Созданы поручения на сентябрь 2021 года','2021-09-01;1;1;;;1001;36'),(1085,'2021-05-12 12:32:04','pavlovob','Созданы поручения на июнь 2021 года','01.06.2021;22;2;;;1001;37'),(1086,'2021-05-12 12:32:27','pavlovob','Созданы поручения на июнь 2021 года','01.06.2021;4;4;;;1001;38'),(1087,'2021-05-12 12:35:59','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;3;;;1001;39'),(1088,'2021-05-12 12:36:14','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;2;2;;;1001;40'),(1089,'2021-05-12 12:39:39','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;1;1;;;1001;41'),(1090,'2021-05-12 12:40:39','pavlovob','Созданы поручения на июнь 2021 года','2021-06-01;2;2;;;1001;42'),(1091,'2021-05-12 12:42:10','pavlovob','Созданы поручения на март 2021 года','2021-03-01;2;3;;;1001;43'),(1092,'2021-05-12 14:02:26','pavlovob','Созданы поручения на октябрь 2021 года','2021-10-01;1;1;;;1001;44'),(1093,'2021-05-12 14:51:57','pavlovob','Добавлена настройка (missions/DefaultDescription)',NULL),(1094,'2021-05-12 14:52:13','pavlovob','Отредактирована настройка (missions/DefaultDescription) на Поручения для подразделений ЯРНУ на',''),(1095,'2021-05-13 14:39:29','Система','Неправильное имя пользователя или пароль','pavlovob'),(1096,'2021-05-13 14:39:39','Система','Неправильное имя пользователя или пароль','pavlovob'),(1097,'2021-05-13 14:39:48','Система','Неправильное имя пользователя или пароль','admin'),(1098,'2021-05-13 14:43:23','Система','Неправильное имя пользователя или пароль','admin'),(1099,'2021-05-13 14:43:33','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1100,'2021-05-13 14:46:12','pavlovob','Пользователю предоставлен доступ','Павлов Олег Борисович'),(1101,'2021-05-20 13:54:02','admin','Пользователю предоставлен доступ',NULL),(1102,'2021-05-20 13:56:58','admin','Созданы поручения на август 2021 года','2021-08-01;1;1;;;1001;45'),(1103,'2021-05-21 09:58:35','admin','Пользователю предоставлен доступ',NULL),(1104,'2021-05-21 10:05:39','admin','Пользователь завершил работу в ИС',NULL),(1105,'2021-05-21 12:07:20','admin','Пользователю предоставлен доступ',NULL),(1106,'2021-05-21 12:07:22','admin','Пользователь завершил работу в ИС',NULL),(1107,'2021-05-21 12:07:29','Система','Неправильное имя пользователя или пароль','user'),(1108,'2021-05-21 12:07:44','Система','Неправильное имя пользователя или пароль','user'),(1109,'2021-05-21 12:08:05','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','user'),(1110,'2021-05-21 12:36:58','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','user'),(1111,'2021-05-21 12:37:02','Система','Неправильное имя пользователя или пароль','user1'),(1112,'2021-05-21 12:37:06','Система','Отсутствует доступ к ИС. Необходимо оформить заявку.','user'),(1113,'2021-05-21 12:37:12','admin','Пользователю предоставлен доступ',NULL),(1114,'2021-05-21 12:37:47','admin','Отредактирована настройка (common/orgname) на ООО \"Рога и копыта\"',''),(1115,'2021-05-21 12:37:56','admin','Отредактирована настройка (committee/s1f) на Иванов И.И.',''),(1116,'2021-05-21 12:38:11','admin','Отредактирована настройка (missions/DefaultDescription) на Поручения для подразделений Общества',''),(1117,'2021-05-25 06:59:03','admin','Пользователю предоставлен доступ',NULL),(1118,'2021-05-28 05:54:57','admin','Пользователю предоставлен доступ',NULL),(1119,'2021-05-28 11:48:09','admin','Пользователю предоставлен доступ',NULL),(1120,'2021-05-28 12:50:20','admin','Созданы поручения.','wqergewrger;2021-05-28;Главный инженер;Иванов И.И.;;;1002;46'),(1121,'2021-05-31 05:26:19','admin','Пользователю предоставлен доступ',NULL),(1122,'2021-05-31 06:48:27','admin','Пользователю предоставлен доступ',NULL),(1123,'2021-05-31 07:12:49','Система','Неправильное имя пользователя или пароль','admin'),(1124,'2021-06-01 06:02:16','Система','Неправильное имя пользователя или пароль','admin'),(1125,'2021-06-01 06:02:24','Система','Неправильное имя пользователя или пароль','admin'),(1126,'2021-06-01 06:02:28','Система','Неправильное имя пользователя или пароль','admin'),(1127,'2021-06-01 06:16:15','admin','Пользователю предоставлен доступ',NULL),(1128,'2021-06-01 06:16:40','admin','Пользователю предоставлен доступ',NULL),(1129,'2021-06-01 06:17:18','admin','Пользователь завершил работу в ИС',NULL),(1130,'2021-06-01 06:20:08','admin','Пользователю предоставлен доступ',NULL),(1131,'2021-06-01 06:22:02','admin','SYSTEM','Удален пользователь  user'),(1132,'2021-06-01 06:22:04','admin','SYSTEM','Удален пользователь  Администратор'),(1133,'2021-06-01 06:22:08','Система','Неправильное имя пользователя или пароль','admin'),(1134,'2021-06-01 06:22:14','admin','Пользователю предоставлен доступ',NULL),(1135,'2021-06-01 06:22:36','admin','Пользователь завершил работу в ИС',NULL),(1136,'2021-06-01 06:22:41','Система','Неправильное имя пользователя или пароль','admin'),(1137,'2021-06-01 06:22:45','admin','Пользователю предоставлен доступ',NULL),(1138,'2021-06-01 06:23:02','admin','SYSTEM','Изменен пароль учетной записи пользователя Администратор'),(1139,'2021-06-01 06:23:04','admin','Пользователь завершил работу в ИС',NULL),(1140,'2021-06-01 06:23:07','Система','Неправильное имя пользователя или пароль','admin'),(1141,'2021-06-01 06:23:12','admin','Пользователю предоставлен доступ',NULL),(1142,'2021-06-01 07:23:50','admin','Пользователю предоставлен доступ',NULL),(1143,'2021-06-01 10:52:22','admin','Пользователю предоставлен доступ',NULL),(1144,'2021-06-01 11:00:11','admin','SYSTEM','Добавлен новый пользователь gjkmpqwejfpwqjepf'),(1145,'2021-06-01 11:35:11','admin','SYSTEM','Отредактированы данные пользователя Администратор'),(1146,'2021-06-01 11:35:14','admin','Пользователь завершил работу в ИС',NULL),(1147,'2021-06-01 11:35:17','admin','Пользователю предоставлен доступ',NULL),(1148,'2021-06-01 11:46:49','admin','В справочник пользователей добавлена запись','123;admin;4;;;2021-06-01 11:46:48;2021-06-01 11:46:48;$2y$13$MRSKOU3JxjCTod8TiI6nmuIozMWrdT3goDD868nypvOa1fN1xa0bK;10'),(1149,'2021-06-01 11:46:58','admin','Пользователь завершил работу в ИС',NULL),(1150,'2021-06-01 11:47:03','Система','Неправильное имя пользователя или пароль','123'),(1151,'2021-06-01 11:47:12','Система','Неправильное имя пользователя или пароль','123'),(1152,'2021-06-01 11:47:17','Система','Неправильное имя пользователя или пароль','123'),(1153,'2021-06-01 11:47:28','admin','Пользователю предоставлен доступ',NULL),(1154,'2021-06-01 11:55:42','admin','SYSTEM','Отредактированы данные пользователя iejfoiwjoiewjrg'),(1155,'2021-06-01 12:22:36','admin','В справочник пользователей добавлена запись','ошного;укреуекрке;4;;;2021-06-01 12:22:35;2021-06-01 12:22:35;$2y$13$P1v09wtlxF91RQyBg78e4O8IV4zsI7Aad39uekWvw0Un5vErxgyfC;11'),(1156,'2021-06-01 12:24:55','admin','В справочник пользователей добавлена запись','уцкпукцп;admin;2;;;2021-06-01 12:24:55;2021-06-01 12:24:55;$2y$13$5CsFhsidE1pQ9ZJ/gDkZX.o6dW5PRiBaZvLSlbjPgc1o.55qYLdTW;12'),(1157,'2021-06-01 12:30:34','admin','В справочник пользователей добавлена запись','уенрекнр;admin;4;;;2021-06-01 12:30:34;2021-06-01 12:30:34;$2y$13$ElJxMGmU0V4/lqg1Jbk04OpkT9uncn4kh8h7P9TtvRWYqJnGfLPhm;13'),(1158,'2021-06-01 12:32:08','admin','SYSTEM','Изменен пароль учетной записи пользователя Администратор'),(1159,'2021-06-01 12:32:29','admin','SYSTEM','Изменен пароль учетной записи пользователя Администратор'),(1160,'2021-06-01 12:34:05','admin','В справочник пользователей добавлена запись','wefwf;admin;4;;;2021-06-01 12:34:05;2021-06-01 12:34:05;$2y$13$z6MQ3ITpto/Vk0i6BzOVDOiBZcDpm55GEp8JDIg8pzxVKwxIrmLme;14'),(1161,'2021-06-01 12:34:20','admin','Пользователь завершил работу в ИС',NULL),(1162,'2021-06-01 12:34:26','Система','Отсутствует доступ к информаицонной системе. Недостаточно прав.','wefwf'),(1163,'2021-06-01 12:34:36','admin','Пользователю предоставлен доступ',NULL),(1164,'2021-06-01 12:35:22','admin','SYSTEM','Отредактированы данные пользователя admin'),(1165,'2021-06-01 12:39:41','admin','SYSTEM','Удален пользователь  укреуекрке'),(1166,'2021-06-01 12:39:44','admin','SYSTEM','Удален пользователь  admin'),(1167,'2021-06-01 12:39:46','admin','SYSTEM','Удален пользователь  admin');
/*!40000 ALTER TABLE `history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `inifile`
--

DROP TABLE IF EXISTS `inifile`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `inifile` (
  `uid` int NOT NULL AUTO_INCREMENT,
  `section` varchar(45) DEFAULT NULL,
  `param` varchar(45) DEFAULT NULL,
  `value` varchar(256) DEFAULT NULL,
  `description` varchar(128) DEFAULT NULL,
  `visible` int DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=59 DEFAULT CHARSET=cp1251;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `inifile`
--

LOCK TABLES `inifile` WRITE;
/*!40000 ALTER TABLE `inifile` DISABLE KEYS */;
INSERT INTO `inifile` VALUES (55,'committee','s1p','Главный инженер','Должность утверждающего поручения',1),(56,'common','orgname','ООО \"Рога и копыта\"','Наименование своей организации',1),(57,'committee','s1f','Иванов И.И.','Ф.И.О. утверждающего поручения',1),(58,'missions','DefaultDescription','Поручения для подразделений Общества','Префикс заголовка поручений по умолчанию',1);
/*!40000 ALTER TABLE `inifile` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `mission_fact`
--

DROP TABLE IF EXISTS `mission_fact`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `mission_fact` (
  `uid` int unsigned NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `uid_UNIQUE` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mission_fact`
--

LOCK TABLES `mission_fact` WRITE;
/*!40000 ALTER TABLE `mission_fact` DISABLE KEYS */;
/*!40000 ALTER TABLE `mission_fact` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `missionitems`
--

DROP TABLE IF EXISTS `missionitems`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `missionitems` (
  `uid` int NOT NULL,
  `missionuid` int NOT NULL,
  `num_pp` int NOT NULL,
  `deadline` datetime NOT NULL,
  `assigneruid` int NOT NULL,
  `assigner_name` varchar(45) NOT NULL,
  `executeruid` int NOT NULL,
  `executer_name` varchar(45) NOT NULL,
  `task` varchar(1000) NOT NULL,
  `description` varchar(1000) DEFAULT NULL,
  `date_created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `date_changed` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `uid_UNIQUE` (`uid`),
  KEY `key_mission` (`missionuid`,`num_pp`),
  CONSTRAINT `fk_missionitems_1` FOREIGN KEY (`missionuid`) REFERENCES `missions` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `missionitems`
--

LOCK TABLES `missionitems` WRITE;
/*!40000 ALTER TABLE `missionitems` DISABLE KEYS */;
/*!40000 ALTER TABLE `missionitems` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `missions`
--

DROP TABLE IF EXISTS `missions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `missions` (
  `uid` int NOT NULL AUTO_INCREMENT,
  `mission_name` varchar(256) NOT NULL,
  `mission_date` date NOT NULL,
  `description` varchar(100) DEFAULT NULL,
  `status` int DEFAULT NULL,
  `approve_post` varchar(100) NOT NULL,
  `approve_fio` varchar(100) NOT NULL,
  `url` varchar(2048) DEFAULT NULL,
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `changed` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `mission_name_UNIQUE` (`mission_name`),
  KEY `key_name` (`mission_date`)
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `missions`
--

LOCK TABLES `missions` WRITE;
/*!40000 ALTER TABLE `missions` DISABLE KEYS */;
INSERT INTO `missions` VALUES (46,'wqergewrger','2021-05-28','',1002,'Главный инженер','Иванов И.И.','','2021-05-28 15:50:20','2021-05-28 15:50:20');
/*!40000 ALTER TABLE `missions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `uid` int NOT NULL AUTO_INCREMENT,
  `login` varchar(64) NOT NULL,
  `username` varchar(128) NOT NULL,
  `password_hash` varchar(256) DEFAULT NULL,
  `usertype` int DEFAULT NULL,
  `executerid` int DEFAULT NULL,
  `assignerid` int DEFAULT NULL,
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `changed` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `login` (`login`),
  KEY `idx-username` (`username`),
  KEY `idx-executer` (`executerid`),
  KEY `idx-assigner` (`assignerid`),
  CONSTRAINT `fk_user_1` FOREIGN KEY (`assignerid`) REFERENCES `assigners` (`uid`) ON DELETE RESTRICT,
  CONSTRAINT `fk_user_2` FOREIGN KEY (`executerid`) REFERENCES `executers` (`uid`) ON DELETE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (8,'admin','Администратор','$2y$13$VKhiVd7gaAvii/ks/UuugOx8tBD5eRdpRAtHO2vVsnZhDg02bgWWa',1,NULL,NULL,'2021-06-01 06:22:10','2021-06-01 12:32:29'),(9,'user','gjkmpqwejfpwqjepf','$2y$13$dbQ/j3dRKaz0UgTFPR9aP.ayID67VT2VqXWF87S.NlWsW1tyt6YjG',NULL,NULL,NULL,'2021-06-01 11:00:11','2021-06-01 11:00:11'),(10,'123','iejfoiwjoiewjrg','$2y$13$MRSKOU3JxjCTod8TiI6nmuIozMWrdT3goDD868nypvOa1fN1xa0bK',4,NULL,NULL,'2021-06-01 11:46:48','2021-06-01 11:55:42'),(14,'wefwf','admin','$2y$13$z6MQ3ITpto/Vk0i6BzOVDOiBZcDpm55GEp8JDIg8pzxVKwxIrmLme',2,NULL,NULL,'2021-06-01 12:34:05','2021-06-01 12:35:22');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `workers`
--

DROP TABLE IF EXISTS `workers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `workers` (
  `uid` int unsigned NOT NULL AUTO_INCREMENT,
  `workername` varchar(100) DEFAULT NULL,
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `changed` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`uid`),
  UNIQUE KEY `workername_UNIQUE` (`workername`),
  KEY `KEY_NAME` (`workername`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=cp1251;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `workers`
--

LOCK TABLES `workers` WRITE;
/*!40000 ALTER TABLE `workers` DISABLE KEYS */;
INSERT INTO `workers` VALUES (3,'qowkglkse;rgl','2019-10-25 11:50:18','2019-10-25 11:50:18');
/*!40000 ALTER TABLE `workers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'missions'
--

--
-- Dumping routines for database 'missions'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-06-01 15:40:49
